export const steps = [
  {
    id: '01',
    title: 'Пошук і перегляд',
    description:
      'Оберіть свого майбутнього компаньйона за допомогою фільтрації: характер, розмір, вік та інші параметри.',
  },
  {
    id: '02',
    title: 'Онлайн-анкетування',
    description:
      'Заповніть просту анкету, щоб ми могли зрозуміти, хто стане вашим ідеальним компаньйоном.',
  },
  {
    id: '03',
    title: 'Відеодзвінок з притулком',
    description:
      'Пройдіть консультацію онлайн або офлайн, щоб обговорити всі деталі.',
  },
  {
    id: '04',
    title: 'Зустріч та адаптація',
    description:
      'Заберіть свого пухнастого друга додому й отримайте рекомендації для легкого знайомства й адаптації.',
  },
];
