import ivanAvatar from '../../../../../assets/images/avatars/ivan.png';
import katerynaAvatar from '../../../../../assets/images/avatars/kateryna.png';
import olhaAvatar from '../../../../../assets/images/avatars/olha.png';

export const reviews = [
  {
    author: {
      image: olhaAvatar,
      name: 'Ольга',
    },
    review:
      'Це було найкраще рішення в моєму житті! Тепер кожен мій день починається з радісного гавкання і теплих обіймів. Дякую за такого чудового друга',
  },
  {
    author: {
      image: ivanAvatar,
      name: 'Ольга',
    },
    review:
      'Ми довго шукали котика, який би полюбив нашу велику родину. Завдяки вашій платформі ми знайшли ідеального компаньйона. Наш Левко – справжній скарб!',
  },
  {
    author: {
      image: katerynaAvatar,
      name: 'Ольга',
    },
    review:
      'Процес був таким простим і зручним! А зараз наш пухнастик наповнює дім теплом і радістю. Ви створюєте дива!',
  },
  {
    author: {
      image: olhaAvatar,
      name: 'Ольга',
    },
    review:
      'Це було найкраще рішення в моєму житті! Тепер кожен мій день починається з радісного гавкання і теплих обіймів. Дякую за такого чудового друга',
  },
  {
    author: {
      image: ivanAvatar,
      name: 'Ольга',
    },
    review:
      'Це було найкраще рішення в моєму житті! Тепер кожен мій день починається з радісного гавкання і теплих обіймів. Дякую за такого чудового друга',
  },
  {
    author: {
      image: katerynaAvatar,
      name: 'Ольга',
    },
    review:
      'Це було найкраще рішення в моєму житті! Тепер кожен мій день починається з радісного гавкання і теплих обіймів. Дякую за такого чудового друга',
  },
];
