enum ErrorCodes {
  // Success
  S001 = 'Успіх',

  // Error
  E001 = 'Необроблена помилка',

  // Auth
  A001 = 'Неавторизований',
  A002 = 'Заборонено',
  A003 = 'Невдала спроба входу',

  // Validation
  V001 = 'Помилка валідації',

  // Not found
  NF001 = 'Анкетування не знайдено',
  NF002 = 'Тваринка не знайдена',
  NF003 = 'Характеристика тваринки не знайдена',
  NF004 = 'Зустріч не знайдена',
  NF005 = 'Анкета не заповнена',
  NF006 = 'Користувач не знайдений',
  NF007 = 'Коментар не знайдений',

  // Conflict
  C001 = 'Користувач з такою електронною поштою вже існує',
  C002 = 'Анкетування вже схвалено або відхилено',
  C003 = 'Код відновлення не було відправлено користувачу раніше',
  C004 = 'Неправильний код відновлення',
  C005 = 'Два паролі не збігаються',
  C006 = 'Зустріч вже завершена або скасована',
  C007 = 'Неможливо перенести зустріч в цьому статусі',
  C008 = 'Неможливо запланувати зустріч для анкетування в цьому статусі',
  C009 = 'Невірна дата планування',
  C010 = 'Неправильний час планування',
  C011 = 'Немає доступних адміністраторів для слоту',
  C012 = 'Порожній файл зображення/інформації',
  C013 = 'Помилка відправки хабу',
  C014 = 'Помилка приєднання до зустрічі хабу',
}

// Функція для отримання повідомлення за кодом
export function getErrorMessage(code: string): string {
  return ErrorCodes[code as keyof typeof ErrorCodes] || 'Невідома помилка';
}
