export const blocks = [
  {
    rating: '10к+',
    title: 'щасливих хвостиків',
    description:
      'Кожна лапка заслуговує на любов, і ми робимо все, щоб це стало реальністю.',
    color: '#F4908259',
  },
  {
    rating: '95%',
    title: 'ідеальних збігів',
    description: 'Наш процес підбору допомагає знаходити ідеальних господарів',
    color: '#E57B9359',
  },
  {
    rating: '99%',
    title: 'щасливих власників',
    description: 'Наша платформа проста, зручна і націлена на результат.',
    color: '#5DD5E459',
  },
  {
    rating: '100+',
    title: 'притулків з нами',
    description:
      "Ми об'єднуємо зусилля по всій країні, створюючи єдину платформу",
    color: '#FCBF4259',
  },
];
